// Задача №6
Console.WriteLine("Введите число:");
int num_1 = Convert.ToInt32(Console.ReadLine());

if (num_1 % 2 == 1)
{
Console.WriteLine("Число " + num_1 + " является: Нечётным");
}
else
{
Console.WriteLine("Число " + num_1 + "является: Чётным");
}
